Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-IT/tmx_teil_2.tmx
Source language: en
Languages: it

source: Adaptors for tool bits [parts of machines]
it: Adattatori per punte di utensili [parti di macchine]

source: Aeration pumps for ponds
it: Pompe di aerazione per stagni

source: Screwdrivers, electric
it: Avvitatori, elettrici

source: Pump impellers
it: Giranti per pompe

source: Rocket engines for the propulsion of aircraft
it: Motori di propulsione a razzo per aerei

source: Wood grippers (Hydraulic -) for forestry use
it: Pinze per il legno (Idrauliche -) per uso forestale

source: Wood grippers [parts of machines]
it: Pinze per il legno [parti di macchine]

source: Filters being parts of machines
it: Filtri che sono parti di macchine

source: Gear boxes for hydraulic transmissions [other than for land vehicles]
it: Scatole del cambio per trasmissioni idrauliche [non per veicoli terrestri]

source: Machines for shaping
it: Macchine per sagomare

source: Slotting machines [for metalworking]
it: Stozzatrici [per la lavorazione dei metalli]

source: Straw bale tightening machines
it: Macchine per legare balle di paglia

source: Thread milling cutters [machine tool]
it: Frese di filettatura [macchine utensili]

source: Paper presses [machines], other than for office use
it: Presse per carta [macchine], non per ufficio

source: Commercial and industrial vacuum cleaners
it: Aspirapolvere commerciali e industriali

source: Power transmissions for aircraft
it: Trasmissioni di potenza per aerei

source: Lawn raking machines
it: Ranghinatori per prati

source: Electric knives and knife sharpeners
it: Coltelli elettrici e affilatrici per coltelli

source: Power valve for carburetors [vehicle parts]
it: Valvole elettriche per carburatori [parti di veicoli]

source: Welding machines
it: Macchine per saldare

source: Wind-powered electricity generators
it: Generatori di elettricità ad energia eolica

source: Seed drills [agricultural implements]
it: Seminatrici [strumenti agricoli]

source: Air brushes for applying paint
it: Aerografi per applicare pitture

source: Transporting machines
it: Macchine per trasporto

source: Tree pruners [machines]
it: Svettatoi [macchine]

source: Intaglio printing machines
it: Macchine per stampa ad intaglio

source: Mechanical tools
it: Utensili meccanici

source: Spring bushes [parts of machines]
it: Boccole per molla [parti di macchine]

source: Dampening units for offset presses
it: Dispositivi di bagnatura per presse offset

source: Demolition hammers [machines]
it: Martelli demolitori [macchine]

source: Bucket wheels
it: Ruote a tazze

source: Rotary tool bits [parts of machines]
it: Punte d'utensili rotanti [parti di macchine]

source: Screens for separating ore [parts of machines]
it: Schermi per separare minerali grezzi [parti di macchine]

source: Screw hoists
it: Argani a vite

source: Truck mills [for mining purposes]
it: Frese a carrello [per uso minerario]

source: Loading platforms for vehicles
it: Piattaforme di carico per veicoli

source: Vibrators [machines] for industrial use
it: Vibratori [macchine] per uso industriale

source: Screw pumps
it: Pompe a vite

source: Servomotors
it: Servomotori

source: Automatic floor scrubbers
it: Lava-pavimenti automatiche

source: Compressors for use on refuse
it: Compressori per uso con rifiuti

source: Concrete spraying machines
it: Spruzzatori di calcestruzzo

source: Continuous vertical conveyors
it: Trasportatori verticali continui

source: Contouring lathes
it: Torni contornatori

source: Crane hooks
it: Ganci per gru

source: Precision machines for producing parts for turbojets
it: Macchine di precisione per la produzione di parti per turbogetti

source: Separating cylinders [machines]
it: Cilindri di separazione [macchine]

source: Turbochargers for machines
it: Turbocompressori per macchine

source: Valves for pumps
it: Valvole per pompe

source: Brushes, electrically operated [parts of machines]
it: Spazzole elettriche [parti di macchine]

source: Tables for machines
it: Tavole per macchine

source: Carding machines
it: Carde [macchine]

source: Lawn aerators [machines]
it: Aeratori per prati [macchine]

source: Centrifugal pumps for condensing units
it: Pompe centrifughe per unità di condensazione

source: Chasers [machines or parts for machines]
it: Incisori [macchine o parti di macchine]

source: Check valves (non-metallic -) [parts of machines]
it: Valvole di ritegno (non metalliche -) [parti di macchine]

source: Abrasive bits for use with machines
it: Punte abrasive da utilizzare con macchine

source: Abrasive instruments [machines]
it: Strumenti per abradere [macchine]

source: Abrasive tools being parts of machines
it: Utensili abrasivi che sono parti di macchine

source: Combined wire strippers and cutters [machines]
it: Pinze spellafili e taglierine combinate [macchine]

source: Diesel electric generators
it: Generatori elettrici diesel

source: Milking installations for automatic milk extraction
it: Impianti di mungitura per l'estrazione automatica del latte

source: Carbon brushes for electrical machines
it: Spazzole di carbone per macchine elettriche

source: Vegetable knives (Electric -)
it: Coltelli per verdure (Elettrici -)

source: Transmission shafts for water vehicles
it: Alberi di trasmissione per veicoli nautici

source: Upward continuous casting machines
it: Macchine per colata continua verso l'alto

source: Grinding tools for grinding machines
it: Utensili abrasivi per smerigliatrici

source: Foundry machines
it: Macchine di fonderia

source: Helical gear units for industrial purposes
it: Unità ad ingranaggi elicoidali per uso industriale

source: Hydraulic circuits for machines
it: Circuiti idraulici per macchine

source: Hydraulic valves [parts of machines]
it: Valvole idrauliche [parti di macchine]

source: Adhesive bands for pulleys
it: Cerchioni adesivi per pulegge

source: Feeders [parts of machines]
it: Trascinatori [parti di macchine]

source: Disintegrators [for chemical processing]
it: Disintegratori [per trattamento chimico]

source: Toothed wheels for driving chains
it: Ruote dentate per catene di trasmissione

source: Digital electro-hydraulic proportioning valves
it: Valvole proporzionali elettroidrauliche digitali

source: Direct current generator brushes [parts of machines]
it: Spazzole di generatore di corrente continua [parti di macchine]

source: Hoses (Non-metallic -) for transferring hydraulic power in machines
it: Tubi flessibili (Non metallici -) per trasferimento dienergia idraulica in macchine

source: Self-lubricating bearings for use in aerospace engines
it: Cuscinetti autolubrificanti per motori aerospaziali

source: Rollers for rotary printing machines
it: Rulli per macchine per la stampa a rotazione

source: Rotary lobe pumps
it: Pompe a lobi rotativi

source: Numerically positioned standard drilling machines
it: Trapanatrici standard a posizionamento numerico

source: Offset printers
it: Stampante offset

source: Stationary circular saws [machines]
it: Seghe circolari fisse [macchine]

source: Drill stands for drilling machines
it: Supporti portatrapano da banco per trapani

source: Suction cleaning machines for use in manufacture
it: Macchine di pulizia ad aspirazione per la fabbricazione

source: Suction fans for the sucking of grain
it: Aspiratori per l'aspirazone di granaglie

source: Suspension ball joints [parts of machines]
it: Giunti a sfera per sospensioni [parti di macchine]

source: Electrical brakes for machines
it: Freni elettrici per macchine

source: Spray valves [parts of machines]
it: Valvole a spruzzo [parti di macchine]

source: Sprayers [machines] for garden use in spraying weedkillers
it: Nebulizzatori [macchine] per giardino per spruzzare diserbanti

source: Sprayers [machines] for household use in spraying weedkillers
it: Nebulizzatori [macchine] per uso domestico per spruzzare diserbanti

source: Sprayers [machines] for use in horticulture
it: Irroratori [macchine] da utilizzare in orticoltura

source: Photo-engraving machines
it: Macchine per fotoincisione

source: Photogravure printing presses
it: Presse da stampa per fotocalcografia

source: Planographic printing machines
it: Macchine per stampa planografica

source: Chemical fiber spinning machines
it: Macchine per filare fibre chimiche

source: Jacquard looms
it: Telai Jacquard

source: Spool adaptors [parts for industrial machine]
it: Adattatori per bobina [parti per macchine industriali]

source: Stern drives for ships
it: Piedi poppieri per navi

source: Straight edge tools [electrically operated]
it: Regoli [ad azionamento elettrico]

source: Industrial trash compacting machines
it: Macchine industriali per compattare rifiuti

source: Internal combustion engines for boats
it: Motori a combustione interna per imbarcazioni

source: Pile drivers [machines]
it: Battipali [macchine]

source: Print trimmers [parts of machine]
it: Taglierine per stampe [parti di macchine]

source: Exhaust systems for vehicles
it: Sistemi di scarico per veicoli

source: Roller tracks for use in belt conveyor apparatus
it: Binari a rulli per apparecchi trasportatori a nastro

source: Flap folding machines
it: Piegatrici per alette

source: Tamping rollers [machines]
it: Rulli compressori [macchine]

source: Taping [tying] machines other than for office use
it: Nastratrici [legatrici] non per ufficio

source: Overload couplings [parts of machines]
it: Giunti di sovraccarico [parti di macchine]

source: Slicing machines (Electric -) for large scale food processing
it: Affettatrici (Elettriche -) per lavorazione di alimenti su larga scala

source: Locomotive cranes
it: Gru locomotive

source: Converters for steelworks
it: Convertitori di acciaierie

source: Abrasive sheets all being parts of machines or power tools
it: Fogli abrasivi (parti di macchine o utensili elettrici)

source: Refrigerant recovery pumps
it: Pompe di recupero refrigeranti

source: Reverse osmosis pumps
it: Pompe ad osmosi inversa

source: Electrical squeezers for fruit and vegetable
it: Spremitrici elettriche per frutta e verdura

source: Fuel dispensing pumps for service stations
it: Distributori di carburante per stazioni di servizio

source: Gasoline lawn mowers
it: Tosaerba a benzina

source: Alternating current motors for airborne vehicles
it: Motori a corrente alternata per veicoli aerei

source: Spraying booms for attachment to vehicles for the purpose of spraying crops
it: Barre irroranti da collegare a veicoli per irrorare coltivazioni

source: Agricultural machines for fertilising
it: Macchine agricole per la concimazione

source: Agricultural machines for grass cutting
it: Macchine agricole per tagliare l'erba

source: Agricultural machines for sowing
it: Macchine agricole per la semina

source: Rack and pinion jacks
it: Cric a cremagliera

source: Power-operated lawn and garden tillers
it: Coltivatori per prati e giardini a motore

source: Air compressors for vehicles
it: Compressori d'aria per veicoli

source: Joggers [agricultural machines]
it: Pareggiatori [macchine agricole]

source: Scarifiers [machines]
it: Scarificatori [macchine]

source: Road rolling [vehicles] machines
it: Compressori stradali [veicoli]

source: Boring machines for use in woodworking
it: Alesatrici per lavorazione del legno

source: Boring robots for repairing the interiors of canalization pipes
it: Robot di perforazione per riparazione dell'interno di tubi di canalizzazione

source: Bearings and bushings [machine parts]
it: Cuscinetti e boccole [parti di macchine]

source: Straw mills [machines]
it: Macinapaglia [macchine]

source: Electric chaff-cutters
it: Tritapaglia elettrici

source: Electric graters
it: Grattugie elettriche

source: Blades for circular saws [machines]
it: Lame per seghe circolari [macchine]

source: Machining centres
it: Macchine transfer

source: Non-woven belts being parts of machines for use in abrading
it: Cinghie non tessute che sono parti di macchine per abradere

source: Pruning shears [other than hand operated]
it: Cesoie per potare [non manuali]

source: Spiral conveyors [machines]
it: Trasportatori a coclea [macchine]

source: Splines (involute -) [parts of machines]
it: Scanalature (involute -) [parti di macchine]

source: Printing machines for printing on product substrates
it: Macchine per la stampa su substrati di prodotti

source: Printing masks [parts of machines]
it: Mascherine da stampa [parti di macchine]

source: Saw blades [parts of machines]
it: Lame di seghe [parti di macchine]

source: Gear units for machines
it: Ingranaggi per macchine

source: Machines for printing labels
it: Macchine per stampare etichette

source: Butchers' knives (Electric -)
it: Coltelli da macellaio (Elettrici -)

source: Butterfly shutters
it: Persiane orientabili

source: Mufflers [parts of exhaust systems]
it: Silenziatori [parti di sistemi di scarico]

source: Discs for clutch thrust bearings, other than for land vehicles
it: Dischi per cuscinetti reggispinta della frizione, non per veicoli terrestri

source: Installations for vacuum packing purposes
it: Impianti per l'imballaggio sottovuoto

source: Oil separators [machines]
it: Separatori dell'olio [macchine]

source: Industrial honing machines
it: Levigatrici industriali

source: Moulding dies [parts of machines]
it: Stampi sbozzatori [parti di macchine]

source: Envelope stuffing and inserting machines [packaging machines]
it: Macchine di riempimento e inserimento buste [impacchettatrici]

source: Food processors (Electric -) for domestic use
it: Robot da cucina (Elettrici -) per uso domestico

source: Spray guns [machines] for extruding putty
it: Pistole a spruzzo [macchine] per estrudere stucco

source: Pressure multipliers for gases
it: Moltiplicatori di pressione per gas

source: Pressure release screws being parts of machines
it: Viti di sfiato della pressione che sono parti di macchine

source: Glazing rollers for use with calendering machines
it: Rulli per lucidatura per macchine calandratrici

source: Rotary index machines
it: Macchine ad indice rotante

source: Baffles [parts of machines, engines or motors]
it: Deflettori [parti di macchine o motori]

source: Drums [parts of machines]
it: Tamburi di macchine

source: Generators for land vehicles
it: Generatori per veicoli terrestri

source: Impact grinding crushers
it: Frantumatori a impatto

source: Impellers for turbo-superchargers
it: Giranti per turbocompressori

source: Imprinting machines for industrial purposes
it: Macchine per stampare per uso industriale

source: Pallet changing devices for machine tools
it: Cambia-pallet per macchine utensili

source: Sowing machines for towing behind tractors
it: Macchine per semina da trainare dietro trattori

source: Paper shredding machines
it: Trituratrici di carta

source: Machine tools for sawing
it: Macchine utensili per segare

source: Grinding machines for the treatment of ceramics and metal
it: Rettificatrici per il trattamento di ceramica e metallo

source: Tools [parts of machines]
it: Utensili [parti di macchine]

source: Satinizing machines
it: Macchine per satinare

source: Bitumen making machines
it: Macchine per fare il bitume

source: Spin driers [machines]
it: Strizzatoi [macchine]

source: Nut spinners [machines]
it: Chiavi giradadi [macchine]

source: Socket spanners [machines]
it: Chiavi a bussola [macchine]

source: Sockets [parts for machines]
it: Prese [parti di macchine]

source: Milling cutters [machine tool]
it: Frese [macchine utensili]

source: Mills [machines]
it: Mulini [macchine]

source: Crimping machines
it: Aggraffatrici

source: Hemming machines
it: Macchine per orlare

source: Nibblers [machines]
it: Roditrici [macchine]

source: Casting machines
it: Macchine per fusione

source: Cutting blow pipes, gas-operated
it: Cannelli a gas per tagliare

source: Welding torches [gas-operated]
it: Cannelli per saldatura [a gas]

source: Soldering blow pipes, gas-operated
it: Cannelli a gas per saldare

source: Clutches for machines
it: Frizioni per macchine

source: Compacting machines
it: Macchine compattatrici

source: Bonding machines
it: Macchine leganti

source: Windlasses
it: Verricelli

source: Bobbin winding machines
it: Avvolgitrici per bobine

source: Winches
it: Argani

source: Hydrodynamic screws
it: Coclee idrauliche

source: Reels [parts of machines]
it: Spolette [parti di macchine]

source: Plungers [machines]
it: Stantuffi [macchine]

source: Tools (Machine -) for use in packaging
it: Utensili (Macchine -) per l'imballaggio

source: Typographic machines
it: Macchine tipografiche

source: Die-stamping machines
it: Stampi [macchine]

source: Automatic dispensing machines
it: Distributore automatico [macchina]

source: Spraying machines
it: Polverizzatori

source: Water separators
it: Separatori d'acqua

source: Lacing machines
it: Macchine legatrici

source: Carburetors [vehicle parts]
it: Carburatori [parti di veicoli]

source: Trimming machines
it: Raddrizzatori

source: Dispensing machines
it: Macchine erogatrici

source: Sweeping, cleaning, washing and laundering machines
it: Macchinari per spazzare, pulire, lavare e per lavanderia

source: Machines and machine tools for treatment of materials and for manufacturing
it: Macchine e macchine utensili per il trattamento di materiali e per la manifattura

source: Pumps, compressors and fans
it: Pompe, compressori e ventole

source: Mills and crushing machines
it: Mulini e macchine frantumatrici

source: Conveyors and conveyors belts
it: Trasportatori e nastri trasportatori

source: Opening and closing mechanisms
it: Meccanismi di apertura e chiusura

source: Lifting and hoisting equipment, elevators and escalators
it: Attrezzatura per ascensori e sollevatori, elvatori e scale mobili

source: Material production and processing machines
it: Macchine per la produzione e lavorazione di materiali

source: Textile and leather sewing equipment
it: Attrezzature per cucire tessuto e pelle

source: Printing and bookbinding machines
it: Macchine per stampare e rilegare libri

source: Waste management and recycling machines
it: Gestione dei rifiuti e macchine per il riciclo

source: Coating machines
it: Macchine spalmatrici

source: Filtering machines, separators and centrifuges
it: Macchine filtanti, separatori e centrifughe

source: Welding and soldering equipment
it: Attrezzatura per saldare

source: Exterior clearing and cleaning equipment
it: Attrezzatura per la pulizia di spazi esterni

source: Ironing machines and laundry presses
it: Stiratrici e presse da stiro

source: 3D printers
it: Stampanti 3D

source: Confectionery making machines
it: Macchine per confetteria

source: Blight prevention machines and implements, other than hand-operated implements
it: Macchine e attrezzature per la prevenzione dell'avvizzimento, tranne quelle azionate manualmente

source: Fertilizer distributing machines and implements, other than hand-operated implements
it: Macchine spandiconcime e utensili, diversi dagli utensili manuali

source: Steam engine boilers for power generation, other than for land vehicles
it: Caldaie a vapore per la produzione d'energia (non per veicoli terrestri)

source: Waste and trash separator machines
it: Macchine separatrici di rifiuti

source: Broadcast seeders
it: Seminatrici a spaglio

source: Hydraulic hoists
it: Paranchi idraulici

source: Turboprop engines [not for land vehicles]
it: Motori a turboelica [non per veicoli terrestri]

source: Metal pulleys being parts of machines
it: Pulegge metalli che sono parti di macchine

source: Rubber tracks being parts of crawlers on construction machines
it: Cingoli in gomma essendo parti di cingolati in macchine da costruzione

source: Rubber tracks being parts of crawlers on loading-unloading machines and apparatus
it: Cingoli in gomma essendo parti di cingolati in macchine ed apparati di carico e scarico

source: Rubber tracks being parts of crawlers on agricultural machines
it: Cingoli in gomma essendo parti di cingolati in macchine agricole

source: Rubber tracks being parts of crawlers on mining machines
it: Cingoli in gomma essendo parti di cingolati in macchine estrattive

source: Rubber tracks being parts of crawlers on snow ploughs
it: Cingoli in gomma essendo parti di cingolati in macchine spazzaneve

source: Angle valves being parts of machines
it: Valvole a squadra [parti di macchine]

source: Ball valves being parts of machines
it: Valvole a sfera [parti di macchine]

source: Belt pulleys being parts of machines
it: Pulegge per cinghie [parti di macchine]

source: Butterfly valves being parts of machines
it: Valvole a farfalla [parti di macchine]

source: Cams being parts of machines
it: Camme [parti di macchine]

source: Cone brakes being parts of machines
it: Freni a cono [parti di macchine]

source: Fluid couplings being parts of machines
it: Accoppiamenti idraulici [parti di macchine]

source: Hydraulic accumulators being parts of machines
it: Accumulatori idraulici [parti di macchine]

source: Hydraulic intensifiers being parts of machines
it: Intensificatori idraulici [parti di macchine]

source: Idling pulleys being parts of machines
it: Pulegge intermediarie [parti di macchine]

source: Laminated leaf-springs being parts of machines
it: Molle a balestra a foglie multiple [parti di macchine]

source: Roller chains being parts of machines
it: Catene a rulli [parti di macchine]

source: Speed change gears being parts of machines
it: Cambi di velocità [parti di macchine]

source: Agitators for chemical processing
it: Agitatori per trattamenti chimici

source: Barley press rollers
it: Rulli per pressare l'orzo

source: Blending machines for chemical processing
it: Macchine di miscelazione per trattamenti chimici

source: Compressing machines
it: Macchine di compressione

source: Dust collecting machines for chemical processing
it: Macchine per la raccolta di polveri per trattamento chimico

source: Electric pepper mills
it: Macinini da pepe elettrici

source: Filtering machines for chemical processing
it: Macchine filtranti per trattamenti chimici

source: Fish-netting machines
it: Macchine per reti da pesca

source: Food chopping machines for commercial use
it: Macchine per tritare alimenti per uso commerciale

source: Food cutting machines for commercial use
it: Macchine per tagliare alimenti per uso commerciale

source: Ignition magnetos for engines
it: Magneti d'accensione per motori

source: Inking apparatus for printing blocks
it: Apparecchi inchiostratori per cliché

source: Intertillage machines
it: Macchine interfilari

source: Kerosene engines, not for land vehicles
it: Motori a cherosene, non per veicoli terrestri

source: Machine tools for breaking up road surface material
it: Macchine utensili per rompere il manto stradale

source: Presses for chemical processing
it: Presse per trattamenti chimici

source: Rocket engines not for land vehicles
it: Motori a razzo non per veicoli terrestri

source: Root slicing machines
it: Macchine trinciaradici

source: Sheet-continuity sequencing machines
it: Macchine per sequenziamento a foglio continuo

source: Yarn spinning machine
it: Macchine per filatura

source: Absorbing machines for chemical processing
it: Macchine di assorbimento per trattamenti chimici

source: Axial flow blowers
it: Ventilatori assiali

source: Axial flow compressors
it: Compressori assiali

source: Centrifugal blowers
it: Soffianti centrifughe

source: Centrifugal compressors
it: Compressori centrifughi

source: Cocoon drying machines
it: Essiccatoi per bozzoli

source: Diffusion pumps
it: Pompe a diffusione

source: Filter presses for chemical processing
it: Filtropresse per trattamenti chimici

source: Reciprocating compressors
it: Compressori alternativi

source: Reciprocating vacuum pumps
it: Pompe a vuoto alternative

source: Rotary compressors
it: Compressori rotativi

source: Sewing machines for household purposes
it: Macchine per cucire per uso domestico
